Table of Contents
 Class Parameter
Namespace
IdeaRS.OpenModel.CrossSection
Assembly
IdeaRS.OpenModel.dll
Common parameter of cross-section
public abstract class Parameter : OpenObject
Inheritance
object
OpenObject
Parameter
Derived
ParameterBool
ParameterDouble
ParameterInt
ParameterReferenceElement
ParameterString
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Name
Name of property
public string Name { get; set; }
Property Value
string
 Edit this page